brew "aws-vault"
brew "awscli"
brew "coreutils"
brew "harper"
brew "htop"
brew "k9s"
brew "kube-linter"
brew "kubernetes-cli"
brew "lazygit"
brew "neovim"
brew "node"
brew "prettier"
brew "pyright"
brew "ruff"
brew "stylua"
brew "tmux"
brew "uv"
brew "wget"
cask "alacritty"
cask "docker-desktop"
cask "font-hack-nerd-font"
cask "itk-snap"
cask "visual-studio-code"
vscode "charliermarsh.ruff"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "mutantdino.resourcemonitor"
vscode "njpwerner.autodocstring"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "vscodevim.vim"
vscode "yinfei.luahelper"
